---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarBendingDetailType.Create(Autodesk.Revit.DB.Document)
zh: 创建、新建、生成、建立、新增
source: html/b70b7dc1-0dd9-1230-fc56-3776777e3325.htm
---
# Autodesk.Revit.DB.Structure.RebarBendingDetailType.Create Method

**中文**: 创建、新建、生成、建立、新增

Creates a new RebarBendingDetailType object.

## Syntax (C#)
```csharp
public static RebarBendingDetailType Create(
	Document Document
)
```

## Parameters
- **Document** (`Autodesk.Revit.DB.Document`) - Document to which the new element should be added.

## Returns
The new RebarBendingDetailType object.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null